app/views/todo_items/_todo_item.html.erb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 6]]
---
    <span class="fa fa-stack">
        <% if @todo_list.todo_items.where("priority < ?", todo_item.priority).last != nil %>