app/controllers/tags_controller.rb

  def create
    @tag = Tag.new(tag_params)

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "work"], ["created_at", "2020-06-30 01:36:36.018335"], ["updated_at", "2020-06-30 01:36:36.018335"]]

  def destroy
    @tag.delete
---
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 11]]