app/controllers/todo_lists_controller.rb

SELECT "todo_list_tags"."tags_id" FROM "todo_list_tags" WHERE "todo_list_tags"."todo_list_id" = ?  [["todo_list_id", 8]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?, ?, ?)  [["id", 1], ["id", 8], ["id", 1]]
SELECT "todo_list_tags".* FROM "todo_list_tags" WHERE "todo_list_tags"."todo_list_id" IS NULL
---
  def show
    @tag_option = Tag.pluck(:name, :id)
    @todo_list_id = params[:id]

    @todo_list_tags = TodoListTag.where(todo_list_id: params[:id]).pluck(:tags_id)
    @tags = Tag.where(id: @todo_list_tags)

UPDATE "todo_lists" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "todo_lists"."id" = ?  [["title", "one"], ["description", "teo"], ["updated_at", "2020-06-24 23:31:23.458775"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 1]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = ?  [["id", 2]]
---
  def destroy
    @todo_item = @todo_list.todo_items.all
    @todo_item.delete(@todo_item)
    if @todo_list.delete