app/controllers/todo_list_tags_controller.rb

  def index
    @todo_list_tags = TodoListTag.all
---
SELECT "todo_list_tags".* FROM "todo_list_tags"

  def destroy
  	@todo_list_tag = TodoListTag.where(tags_id: params[:tags_id], todo_list_id: params[:todo_list_id])
  	if @todo_list_tag.delete_all
---
SELECT "todo_list_tags".* FROM "todo_list_tags" WHERE "todo_list_tags"."tags_id" = ? AND "todo_list_tags"."todo_list_id" = ?  [["tags_id", 1], ["todo_list_id", 1]]
DELETE FROM "todo_list_tags" WHERE "todo_list_tags"."tags_id" = ? AND "todo_list_tags"."todo_list_id" = ?  [["tags_id", 2], ["todo_list_id", 1]]